
# Key fields used:

# For production - - - - - - - - - -
# var:
#   G1 - зібрана площа, га/середньорічне поголів'я, голів
#   G2 - вироблено продукції, ц
#   G3 - виробнича собівартість, тис.грн.
#   G4 - Реалізація продукції у фізичній масі, ц
#   G5 - Реалізація продукції, виробнича собівартість, тис.грн.
#   G6 - Реалізація продукції, повна собівартість, тис.грн.
#   G7 - Реалізація продукції чистий дохід (виручка) від реалізації, тис.грн.

# code:
#   10 -  ПРОДУКЦІЯ РОСЛИННИЦТВА – всього (сума кодів 0020, 0040–0120)
#     25 - пшениця озима
#     21 - пшениця яра
#     30 - кукурудза на зерно
#   130 - ПРОДУКЦІЯ ТВАРИННИЦТВА – всього  (сума кодів 0140 – 0210)	0130
#   216 -`ПРОДУКЦІЯ СІЛЬСЬКОГО ГОСПОДАРСТВА  І ПОСЛУГИ  – всьо-го (сума кодів 0010, 0130, 0212)

# For resources - - - - - - - - - -
# var:
# G1  - Виробнича собівартість - усього, (гр.3 розділу 1) (сума граф 2, 8, 9)
#   Утому числі
#   G2  - прямі матеріальні витрати (сума  граф 3–7)
#     з них	прямі
#     G3  - насіння та посадковий матеріал
#     G4  - мінеральні добрива
#     G5  - пальне і мастильні матеріали
#     G6  - оплата послуг і робіт сторонніх організацій
#     G7  - решта матеріальних витрат
#   G8  - витрати на оплату праці
#   G9  - інші прямі витрати та загальновиробничі витрати -  всього (сума граф 10–12)
#     з них:
#     G10   - амортизація необоротних активів
#     G11   - відрахування на соціальні заходи
#     G12   - решта ін. прямих та загальновиробничих витрат
# code:
#   601 - Пшениця
#   603 - Кукурудза на зерно

# земля
# var:
#   G1  - Усього
#   G2  - Взято у оренду
# code:
#   450 - Площа сільськогосподарських угідь – всього (без землі, що здана в оренду), га
#   451 - У тому числі  рілля


# Selecting only the fields needed for comparison ------------------------


# code:
#   10 -  ПРОДУКЦІЯ РОСЛИННИЦТВА – всього (сума кодів 0020, 0040–0120)
#     25 - пшениця озима
#     21 - пшениця яра
#     30 - кукурудза на зерно
#   130 - ПРОДУКЦІЯ ТВАРИННИЦТВА – всього  (сума кодів 0140 – 0210)	0130
#   216 -`ПРОДУКЦІЯ СІЛЬСЬКОГО ГОСПОДАРСТВА  І ПОСЛУГИ  – всьо-го (сума кодів 0010, 0130, 0212)


vars <- c("G7")
codes <- c("10", "25", "21", "30", "130", "212", "216")



# Detectin % of total income generated from agriculture and % of total
#   income generated from producing particular crops:
# companies <-
#   data %>%
#   filter(var %in% vars, code %in% codes, !is.na(val)) %>%
#   spread(code, val) %>%
#   mutate(
#     `10/216` = ifelse(is.na(`10` / `216`), 0 , `10` / `216`),
#     `(21+25+30)/10` = ifelse(is.na((`21` + `25` + `30`) / `10`), 0 , (`21` +
#                                                                         `25` + `30`) / `10`)
#   ) %>%
#   mutate(spec_rosl = `10/216` >= 0.75) %>%
#   mutate(spec_pshen = `(21+25+30)/10` >= 0.50) %>%
#   select(forma, god, final_code, var, spec_pshen, spec_rosl) %>%
#   distinct()
# expession = 'sum(get_sg_val(df, "21", "G7"), get_sg_val(df, "25", "G7"), get_sg_val(df, "30", "G7"), na.rm = TRUE) / get_sg_val(df, "10", "G7")'
# 
# 
# transl_sg_expr <- function(expr, data_val = "df") {
#   expr
# }

